<template>
    <div class="p-4">
        <h1 class="text-2xl font-bold mb-4">Инструкция по использованию приложения</h1>
        <div class="flex w-full h-full justify-between">
            <div class="flex-1 flex-col justify-between mr-2">
                <div class="bg-white p-2 mb-2 h-4/5 w-full">
                    <ol class="list-decimal ml-5">
                        <li>Выберите период с которого будут отображаться задачи.</li>
                        <li>Нажмите на кнопку "Сделки" для отображения сделок. Чтобы посмотреть задачи по ним, нужно нажать на любую сделку из таблицы.</li>
                        <li>Нажмите на кнопку "Задачи" для отображения всех задач за период.</li>
                        <li>Нажмите на кнопку "Занятость по сотрудникам за период" для отображения занятости по сотрудникам за период. Если у задач не шло время, то   отображаться они не будут.</li>
                        <li>Нажмите на кнопку "Excel" для экспорта данных в файл Excel.</li>
                        <li>Нажмите на занятость по проектам, если вам необходимо увидеть занятость по проектам.</li>
                        <li>Инструкция по управлению проектами находится во вкладке занятость по проектам.</li>
                    </ol>
                </div>
                <div class="bg-white p-2 w-full">
                    <p>Если вам нужно иначе просчитывать время задач, напишите нам, мы можем продемонстрировать готовое решение по подсчёту времени в задачах и внедрить его вам!</p>
                </div>
            </div>
            <div class="w-2/5 h-full flex-col justify-between">
                <div class="bg-white p-2 mb-2 h-1/2">
                    Обращаем внимание, что время будет учитываться только когда задача ставится на паузу, а в отчёте она появится, когда изменится статус задачи (Ждёт выполнения, В работе и т.д). Укажите в пустом поле рабочее время сотрудников (Например: 8). На каждую задачу и сделку можно нажать, чтобы перейти к более детальному анализу.
                </div>
                <div class="bg-white p-2">
                    <div class="flex">
                        <div class="bg-yellow-200 w-10 h-5"></div>
                        <p>задачи и сделки у которых не указано планируемое время.</p>
                    </div>
                    <div class="flex">
                        <div class="bg-blue-400 w-10 h-5"></div>
                        <p>задачи и сделки, которые находятся в процессе выполнения.</p>
                    </div>
                    <div class="flex">
                        <div class="bg-green-400 w-10 h-5"></div>
                        <p>завершённые задачи и сделки.</p>
                    </div>
                    <div class="flex">
                        <div class="bg-red-400 w-10 h-5"></div>
                        <p>задачи и сделки с переработкой по времени.</p>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template> 